Tekla.Structures.Catalogs.CatalogItemEnumeratorInitializationException
The CatalogItemEnumeratorInitializationException class represents an error that occurred during the catalog item enumerator initialization.
This class cannot be inherited.

Tekla.Structures.Catalogs.CatalogItemEnumeratorInitializationException.#ctor
Initializes a default instance of the CatalogItemEnumeratorInitializationException class.

Tekla.Structures.Catalogs.CatalogItemEnumeratorInitializationException.#ctor(System.String)
Initializes an instance of the CatalogItemEnumeratorInitializationException class with the appropriate error message.
message: Appropriate error message

Tekla.Structures.Catalogs.CatalogItemEnumeratorInitializationException.#ctor(System.String,System.Exception)
Initializes an instance of the CatalogItemEnumeratorInitializationException class with the appropriate error message and inner exception.
message: Appropriate error message.
innerException: Inner exception to indicate more specific reason for the error.